Attempted an invalid element rotate, mirror, or move.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId UnableToTransformElement { get; }
  Visual Basic
Public Shared ReadOnly Property UnableToTransformElement As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ UnableToTransformElement {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace